<template>
  <div>
    <h3>中国人寿</h3>
    <pre>
<h5>HTTP2.0 和 HTTP1.0 的区别，HTTP2.0 有什么缺点</h5>

<h5>闭包及闭包的使用场景</h5>
>闭包的概念：
  当一个函数执行的时候会形成一个私有的的上下文作用域，用于保护和保存私有变量这种机制叫做闭包；

  正常的情况下，一个函数执行完成后，就会立即会释放，但是如果在上下文中有个变量被占用，从而形成了当前的上下文不能被销毁
  函数在执行的时候，会形成一个上下文，这个函数可能会被释放，也可能不被释放，无论释放与否他的作用分别是保护和保存
  保护：保护自己的私有变量不被外界干扰
  保存：如果上下文不被释放，上下文定义的变量可以理解为保存了下来，可以供下级调取使用
>闭包的形成
 函数的嵌套，函数被外层引用
>闭包应用场景
settimeout延时回调，匿名函数
>闭包缺点：
 闭包导致函数中的数量一直存在内存中，不被释放，导致内存泄漏；
>

<h5>实现一个侧边栏组件思路</h5>

<h5>浏览器缓存机制</h5>
浏览器的缓存机制分为强制缓存和协商缓存
浏览器向服务器一个http请求，首先会向浏览器缓存中查找
  如果没有数据结果和缓存标识，强制缓存失败，想服务器发送http请求；
  如果查找数据，但是数据已失效，浏览器带着缓存标识发送http请求，由服务器来决定是否使用缓存数据，如果服务器的数据没有更新，则会返回304，我们则
  取浏览器缓存中读取数据，返回给浏览器，如果服务器的数据更新了，则返回新的数据和200状态，新的数据将存入浏览器缓存中
  
<h5>重排与重绘，怎么减少重排</h5>
重排：重新排布局，元素的位置和尺寸大小发生变化会影响dom重新绘制（影响比较大一些）
    页面的第一次渲染
    改变浏览器窗口尺寸 resize事件发生
    改变元素内容/位置/尺寸
    添加/删除dom元素
重绘：绘制dom外观（比如颜色，字体大小）

1.position属性为absolute或fixed
2. 样式集中改变

<h5>DOM 事件机制，不会冒泡的事件</h5>

<h5>cookie 和 session 的区别</h5>
cookie：
  缓存会发送给后台，内存比较小大约4kb，存储在服务器
session
  缓存存储在本地，内存大一些，浏览器关闭缓存会消失
<h5>sql 相关操作，增删查改</h5>

<h5>web 安全，xss、csrf 攻击特点及防御方式</h5>
 xss：
  跨站脚本攻击：在web页面里面插入可执行的代码脚本，当用户访问页面的时候，潜入web里面的代码会执行，从而达到用户
  获取用户信息的目的；
 csrf：跨站请求伪造
  用户借助你的身份进入操作；诱导用户打开黑客的网站，在黑客的网站中，利用用户登录状态发起跨站点请求。
  1. 尽量使用POST，限制GET（报漏信息）
  2. 浏览器Cookie策略（Session Cookie（在浏览器关闭后，就会失效，保存到内存里）
  3. token
  4. 加验证码
    </pre>
  </div>
</template>