<template>
  <div>
    <pre>
      <h5>hooks用过吗？聊聊react中class组件和函数组件的区别</h5>
      class类组件：使用es6中的class类定义的组件
      fn函数组件： 接受一个单一的props对象，返回一个react元素

      React两套api分别是类组件和函数组件（hooks钩子）
       官方推荐使用钩子函数，代码简洁，代码少，用起来比较轻，hooks钩子是函数，更符合react函数本质
      react函数只做一件事情，返回组件的html代码，而没有其他的功能，不改变函数外部数据结构，函数执行过程中没有副作用；

      类是数据和逻辑的封装，组件的状态和操作方法封装在一起，

      类组件的缺点：
        大型组件难以拆分，不易阅读和维护
        组件引入了复杂的编程模式，高阶组件
        class类中this指向

      区别：
        函数组件性能比类组件的性能高，类组件使用的时候需要实例化，函数组件使用的时候只需要取函数返回值即可；
        hooks出现之前 函数中没有this，state，生命周期，没有事例，被称之为无状态组件】
        hooks出现之前 函数不负责逻辑，只负责UI样式，本身没有逻辑处理，称之为纯函数；

      React hooks（钩子函数）：
        react hooks中常用的钩子
        1. useState（）// 状态钩子
        2. useContext（）// 状态共享钩子
        3. useReducer（） // action钩子
        4. useEffect（）// 副作用钩子

      <h5>React 组件通信方式</h5>
      1. 父组件向子组件通信
      2. 子组件向父组件通信
      3. 跨级组件通信
      4. 非嵌套关系的组件通信
      <h5>setState 既存在异步情况也存在同步情况</h5>
      <h5>react生命周期</h5>
      <h5>何时要使用异步组件？如和使用异步组件</h5>
      <h5></h5>
      <h5></h5>
      <h5></h5>
      <h5></h5>
      <h5></h5>
      <h5></h5>
      <h5></h5>
      <h5></h5>
      <h5></h5>
    </pre>
  </div>
</template>